In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\user\anaconda3\lib\site-packages (2.2.9)

In [1]:
import mysql.connector  #importing database
database = mysql.connector.connect(host="localhost",
                                   user="root",
                                   password="",
                                   database = "python")
db = database.cursor()

In [2]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

('ram', 30, 20)
('shyam', 31, 21)
('hari', 32, 22)
('gita', 33, 23)

In [3]:
# reading from database
db.execute("SELECT name FROM student")
result =db.fetchall()
for x in result:
    print(x)

('ram',)
('shyam',)
('hari',)
('gita',)

In [6]:
sql = '''INSERT INTO student (`name`,`roll`,`age`) 
                            VALUES ('Sita', '78', '22');'''

db.execute(sql)
database.commit()

In [7]:
# reading from database
db.execute("SELECT * FROM student WHERE name = 'Sita'")
result =db.fetchall()
for x in result:
    print(x)

('Sita', 78, 22)

In [8]:
#Delete
sql = "DELETE FROM student WHERE name = 'Sita'"
db.execute(sql)
database.commit()

In [9]:
#Update
sql = "UPDATE student SET name = 'ghanshyam' WHERE age=20"
db.execute(sql)
database.commit()

In [17]:
# WAP to insert student data by taking user input
import mysql.connector  #importing database
database = mysql.connector.connect(host="localhost",
                                   user="root",
                                   password="",
                                   database = "python")
db = database.cursor()
Name = input("Enter name of the student : ")
Roll = int(input("Enter roll of the student : "))
Age = int(input("Enter age of the student : "))
s = '''INSERT INTO student (`name`,`roll`,`age`) VALUES (%s,%s,%);'''
t=(Name,Roll,Age);
db.execute(s,t)
database.commit()

Enter name of the student : saugat
Enter roll of the student : 56
Enter age of the student : 76

ProgrammingError: Not all parameters were used in the SQL statement